awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f001bx4.h
/********************************* Bit definition for PWM_DIER register *********************************************/
#define PWM_DIER_UIE_Pos                          (0U)
#define PWM_DIER_UIE_Msk                          (0x1UL<<PWM_DIER_UIE_Pos)                         /*!< 0x00000001 */
#define PWM_DIER_UIE                              PWM_DIER_UIE_Msk                                  
#define PWM_DIER_OC1IE_Pos                        (1U)
#define PWM_DIER_OC1IE_Msk                        (0x1UL<<PWM_DIER_OC1IE_Pos)                       /*!< 0x00000002 */
#define PWM_DIER_OC1IE                            PWM_DIER_OC1IE_Msk        
#define PWM_DIER_LED1_ENDIE_Pos                   (16U)
#define PWM_DIER_LED1_ENDIE_Msk                   (0x1UL<<PWM_DIER_LED1_ENDIE_Pos)                  /*!< 0x00010000 */
#define PWM_DIER_LED1_ENDIE                       PWM_DIER_LED1_ENDIE_Msk                                                          

/********************************* Bit definition for PWM_SR register ***********************************************/
#define PWM_SR_UIF_Pos                            (0U)
#define PWM_SR_UIF_Msk                            (0x1UL<<PWM_SR_UIF_Pos)                           /*!< 0x00000001 */
#define PWM_SR_UIF                                PWM_SR_UIF_Msk                                    
#define PWM_SR_OC1IF_Pos                          (1U)
#define PWM_SR_OC1IF_Msk                          (0x1UL<<PWM_SR_OC1IF_Pos)                         /*!< 0x00000002 */
#define PWM_SR_OC1IF                              PWM_SR_OC1IF_Msk  
#define PWM_SR_LED1_ENDIF_Pos                     (16U)
#define PWM_SR_LED1_ENDIF_Msk                     (0x1UL<<PWM_SR_LED1_ENDIF_Pos)                         /*!< 0x00000002 */
#define PWM_SR_LED1_ENDIF                         PWM_SR_LED1_ENDIF_Msk                                  

/********************************* Bit definition for PWM_EGR register **********************************************/
#define PWM_EGR_UG_Pos                            (0U)
#define PWM_EGR_UG_Msk                            (0x1UL<<PWM_EGR_UG_Pos)                           /*!< 0x00000001 */
#define PWM_EGR_UG                                PWM_EGR_UG_Msk                                    

/********************************* Bit definition for PWM_CMR register **********************************************/
#define PWM_CMR_OC1M_Pos                          (0U)
#define PWM_CMR_OC1M_Msk                          (0x3UL<<PWM_CMR_OC1M_Pos)                         /*!< 0x00000003 */
#define PWM_CMR_OC1M                              PWM_CMR_OC1M_Msk
#define PWM_CMR_OC1M_0                            (0x1UL<<PWM_CMR_OC1M_Pos)                         /*!< 0x00000001 */
#define PWM_CMR_OC1M_1                            (0x2UL<<PWM_CMR_OC1M_Pos)                         /*!< 0x00000002 */
#define PWM_CMR_OC1PE_Pos                         (8U)
#define PWM_CMR_OC1PE_Msk                         (0x1UL<<PWM_CMR_OC1PE_Pos)                        /*!< 0x00000100 */
#define PWM_CMR_OC1PE                             PWM_CMR_OC1PE_Msk                                 

/********************************* Bit definition for PWM_CER register **********************************************/
#define PWM_CER_C1E_Pos                           (0U)
#define PWM_CER_C1E_Msk                           (0x1UL<<PWM_CER_C1E_Pos)                          /*!< 0x00000001 */
#define PWM_CER_C1E                               PWM_CER_C1E_Msk                                   
#define PWM_CER_C1P_Pos                           (1U)
#define PWM_CER_C1P_Msk                           (0x1UL<<PWM_CER_C1P_Pos)                          /*!< 0x00000002 */
#define PWM_CER_C1P                               PWM_CER_C1P_Msk                                   

/********************************* Bit definition for PWM_CNT register **********************************************/
#define PWM_CNT_CNT_Pos                           (0U)
#define PWM_CNT_CNT_Msk                           (0x3FFUL<<PWM_CNT_CNT_Pos)                       /*!< 0x000003FF */
#define PWM_CNT_CNT                               PWM_CNT_CNT_Msk

/********************************* Bit definition for PWM_PSC register **********************************************/
#define PWM_PSC_PSC_Pos                           (0U)
#define PWM_PSC_PSC_Msk                           (0xFFUL<<PWM_PSC_PSC_Pos)                       /*!< 0x000000FF */
#define PWM_PSC_PSC                               PWM_PSC_PSC_Msk

/********************************* Bit definition for PWM_ARR register **********************************************/
#define PWM_ARR_ARR_Pos                           (0U)
#define PWM_ARR_ARR_Msk                           (0x3FFUL<<PWM_ARR_ARR_Pos)                       /*!< 0x000003FF */
#define PWM_ARR_ARR                               PWM_ARR_ARR_Msk

/********************************* Bit definition for PWM_CCR1 register *********************************************/
#define PWM_CCR1_CCR1_Pos                         (0U)
#define PWM_CCR1_CCR1_Msk                         (0x3FFUL<<PWM_CCR1_CCR1_Pos)                     /*!< 0x000003FF */
#define PWM_CCR1_CCR1                             PWM_CCR1_CCR1_Msk

/********************************* Bit definition for PWM_LED1 register *********************************************/
#define PWM_LED1_DATA_Pos                         (0U)
#define PWM_LED1_DATA_Msk                         (0xFFFFFFUL<<PWM_LED1_DATA_Pos)                     /*!< 0x000003FF */
#define PWM_LED1_DATA                             PWM_LED1_DATA_Msk







/******************************************************************************/
/*                                                                            */
/*      Universal Synchronous Asynchronous Receiver Transmitter (UART)        */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for UART_DR register **********************/
#define UART_DR_DR_Pos              (0U)
#define UART_DR_DR_Msk              (0x1FFUL<<UART_DR_DR_Pos)                  /*!< 0x000001FF */
#define UART_DR_DR                  UART_DR_DR_Msk                             /*!< Receive/send data register */

/******************  Bit definition for UART_BRR register **********************/
#define UART_BRR_BRR_Pos            (0U)
#define UART_BRR_BRR_Msk            (0xFFFFUL<<UART_BRR_BRR_Pos)                /*!< 0x0000FFFF */
#define UART_BRR_BRR                UART_BRR_BRR_Msk                            /*!< Baud rate register */

/******************  Bit definition for UART_SR register **********************/
#define UART_SR_RXNE_Pos            (0U)
#define UART_SR_RXNE_Msk            (0x1UL<<UART_SR_RXNE_Pos)                  /*!< 0x00000001 */
#define UART_SR_RXNE                UART_SR_RXNE_Msk                           /*!< Receive register not empty */
#define UART_SR_ORE_Pos             (1U)
#define UART_SR_ORE_Msk             (0x1UL<<UART_SR_ORE_Pos)                   /*!< 0x00000002 */
#define UART_SR_ORE                 UART_SR_ORE_Msk                            /*!< Overrun error bit */
#define UART_SR_PE_Pos              (2U)
#define UART_SR_PE_Msk              (0x1UL<<UART_SR_PE_Pos)                    /*!< 0x00000004 */
#define UART_SR_PE                  UART_SR_PE_Msk                             /*!< Parity Error bit */
#define UART_SR_FE_Pos              (3U)
#define UART_SR_FE_Msk              (0x1UL<<UART_SR_FE_Pos)                    /*!< 0x00000008 */
#define UART_SR_FE                  UART_SR_FE_Msk                             /*!< Framing Error bit */
#define UART_SR_BRI_Pos             (4U)
#define UART_SR_BRI_Msk             (0x1UL<<UART_SR_BRI_Pos)                   /*!< 0x00000010 */
#define UART_SR_BRI                 UART_SR_BRI_Msk                            /*!< Break Interrupt bit */
#define UART_SR_TDRE_Pos            (5U)
#define UART_SR_TDRE_Msk            (0x1UL<<UART_SR_TDRE_Pos)                  /*!< 0x00000020 */
#define UART_SR_TDRE                UART_SR_TDRE_Msk                           /*!< Transmit Holding Register Empty bit */
#define UART_SR_TXE_Pos             (6U)
#define UART_SR_TXE_Msk             (0x1UL<<UART_SR_TXE_Pos)                   /*!< 0x00000040 */
#define UART_SR_TXE                 UART_SR_TXE_Msk                            /*!< Transmitter Empty bit */
#define UART_SR_ADDR_RCVD_Pos       (8U)
#define UART_SR_ADDR_RCVD_Msk       (0x1UL<<UART_SR_ADDR_RCVD_Pos)             /*!< 0x00000100 */
#define UART_SR_ADDR_RCVD           UART_SR_ADDR_RCVD_Msk                      /*!< Address Received Bit */
#define UART_SR_BUSY_Pos            (9U)
#define UART_SR_BUSY_Msk            (0x1UL<<UART_SR_BUSY_Pos)                  /*!< 0x00000200 */
#define UART_SR_BUSY                UART_SR_BUSY_Msk                           /*!< UART Busy */
#define UART_SR_BUSY_ERR_Pos        (10U)
#define UART_SR_BUSY_ERR_Msk        (0x1UL<<UART_SR_BUSY_ERR_Pos)              /*!< 0x00000400 */
#define UART_SR_BUSY_ERR            UART_SR_BUSY_ERR_Msk                       /*!< Busy Detect Error */

