awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f001bx4.h
/******************  Bit definition for UART_CR1 register **********************/
#define UART_CR1_M_Pos              (0U)
#define UART_CR1_M_Msk              (0x3UL<<UART_CR1_M_Pos)                     /*!< 0x00000003 */
#define UART_CR1_M                  UART_CR1_M_Msk                              /*!< Data Length Select */
#define UART_CR1_M_0                (0x1UL<<UART_CR1_M_Pos)                     /*!< 0x00000001 */
#define UART_CR1_M_1                (0x2UL<<UART_CR1_M_Pos)                     /*!< 0x00000002 */
#define UART_CR1_STOP_Pos           (2U)
#define UART_CR1_STOP_Msk           (0x1UL<<UART_CR1_STOP_Pos)                  /*!< 0x00000004 */
#define UART_CR1_STOP               UART_CR1_STOP_Msk                           /*!< Number of stop bits */
#define UART_CR1_PCE_Pos            (3U)
#define UART_CR1_PCE_Msk            (0x1UL<<UART_CR1_PCE_Pos)                   /*!< 0x00000008 */
#define UART_CR1_PCE                UART_CR1_PCE_Msk                            /*!< Parity Enable */
#define UART_CR1_PS_Pos             (4U)
#define UART_CR1_PS_Msk             (0x1UL<<UART_CR1_PS_Pos)                    /*!< 0x00000010 */
#define UART_CR1_PS                 UART_CR1_PS_Msk                             /*!< Even Parity Select */
#define UART_CR1_SP_Pos             (5U)
#define UART_CR1_SP_Msk             (0x1UL<<UART_CR1_SP_Pos)                    /*!< 0x00000020 */
#define UART_CR1_SP                 UART_CR1_SP_Msk                             /*!< Stick Parity */
#define UART_CR1_SBK_Pos            (6U)
#define UART_CR1_SBK_Msk            (0x1UL<<UART_CR1_SBK_Pos)                   /*!< 0x00000040 */
#define UART_CR1_SBK                UART_CR1_SBK_Msk                            /*!< Send Break */
#define UART_CR1_SWAP_Pos           (8U)
#define UART_CR1_SWAP_Msk           (0x1UL<<UART_CR1_SWAP_Pos)                  /*!< 0x00000100 */
#define UART_CR1_SWAP               UART_CR1_SWAP_Msk                           /*!< TX/RX pin swap */
#define UART_CR1_MSBFIRST_Pos       (9U)
#define UART_CR1_MSBFIRST_Msk       (0x1UL<<UART_CR1_MSBFIRST_Pos)              /*!< 0x00000200 */
#define UART_CR1_MSBFIRST           UART_CR1_MSBFIRST_Msk                       /*!< MSB first mode */

/******************  Bit definition for UART_CR2 register **********************/
#define UART_CR2_RXNEIE_Pos         (0U)
#define UART_CR2_RXNEIE_Msk         (0x1UL<<UART_CR2_RXNEIE_Pos)                /*!< 0x00000001 */
#define UART_CR2_RXNEIE             UART_CR2_RXNEIE_Msk                         /*!< Enable Received Data Available Interrupt */
#define UART_CR2_TDREIE_Pos         (1U)
#define UART_CR2_TDREIE_Msk         (0x1UL<<UART_CR2_TDREIE_Pos)                /*!< 0x00000002 */
#define UART_CR2_TDREIE             UART_CR2_TDREIE_Msk                         /*!< Enable Transmit Holding Register Empty Interrupt */
#define UART_CR2_LSIE_Pos           (2U)
#define UART_CR2_LSIE_Msk           (0x1UL<<UART_CR2_LSIE_Pos)                  /*!< 0x00000004 */
#define UART_CR2_LSIE               UART_CR2_LSIE_Msk                           /*!< Enable Receiver Line Status Interrupt */
#define UART_CR2_BUSYERRIE_Pos      (3U)
#define UART_CR2_BUSYERRIE_Msk      (0x1UL<<UART_CR2_BUSYERRIE_Pos)             /*!< 0x00000008 */
#define UART_CR2_BUSYERRIE          UART_CR2_BUSYERRIE_Msk                      /*!< Enable Busyerr state interruption */
#define UART_CR2_TXEIE_Pos          (4U)
#define UART_CR2_TXEIE_Msk          (0x1UL<<UART_CR2_TXEIE_Pos)                 /*!< 0x00000010 */
#define UART_CR2_TXEIE              UART_CR2_TXEIE_Msk                          /*!< Enable tx empty interruption */

/******************  Bit definition for UART_CR3 register **********************/
#define UART_CR3_M_E_Pos            (0U)
#define UART_CR3_M_E_Msk            (0x1UL<<UART_CR3_M_E_Pos)                   /*!< 0x00000001 */
#define UART_CR3_M_E                UART_CR3_M_E_Msk                            /*!< Extension for DLS */
#define UART_CR3_ADDR_MATCH_Pos     (1U)
#define UART_CR3_ADDR_MATCH_Msk     (0x1UL<<UART_CR3_ADDR_MATCH_Pos)            /*!< 0x00000002 */
#define UART_CR3_ADDR_MATCH         UART_CR3_ADDR_MATCH_Msk                     /*!<  Address Match Mode */
#define UART_CR3_SEND_ADDR_Pos      (2U)
#define UART_CR3_SEND_ADDR_Msk      (0x1UL<<UART_CR3_SEND_ADDR_Pos)             /*!< 0x00000004 */
#define UART_CR3_SEND_ADDR          UART_CR3_SEND_ADDR_Msk                      /*!< Send address control bit */
#define UART_CR3_TX_MODE_Pos        (3U)
#define UART_CR3_TX_MODE_Msk        (0x1UL<<UART_CR3_TX_MODE_Pos)               /*!< 0x00000008 */
#define UART_CR3_TX_MODE            UART_CR3_TX_MODE_Msk                        /*!< Transmit mode control bit */

/******************  Bit definition for UART_RAR register **********************/
#define UART_RAR_RAR_Pos            (0U)
#define UART_RAR_RAR_Msk            (0xFFUL<<UART_RAR_RAR_Pos)                  /*!< 0x000000FF */
#define UART_RAR_RAR                UART_RAR_RAR_Msk                            /*!< Receive address matching register */

/******************  Bit definition for UART_TAR register **********************/
#define UART_TAR_TAR_Pos            (0U)
#define UART_TAR_TAR_Msk            (0xFFUL<<UART_TAR_TAR_Pos)                  /*!< 0x000000FF */
#define UART_TAR_TAR                UART_TAR_TAR_Msk                            /*!< Transmit address matching register */

/******************  Bit definition for UART_BRRF register *********************/
#define UART_BRRF_BRRF_Pos          (0U)
#define UART_BRRF_BRRF_Msk          (0xFUL<<UART_BRRF_BRRF_Pos)                 /*!< 0x0000000F */
#define UART_BRRF_BRRF              UART_BRRF_BRRF_Msk                          /*!< Baud rate fractional register */
#define UART_BRRF_BRRF_0            (0x1UL<<UART_BRRF_BRRF_Pos)                 /*!< 0x00000001 */
#define UART_BRRF_BRRF_1            (0x2UL<<UART_BRRF_BRRF_Pos)                 /*!< 0x00000002 */
#define UART_BRRF_BRRF_2            (0x4UL<<UART_BRRF_BRRF_Pos)                 /*!< 0x00000004 */
#define UART_BRRF_BRRF_3            (0x8UL<<UART_BRRF_BRRF_Pos)                 /*!< 0x00000008 */

/******************************************************************************/
/*                                                                            */
/*                     Voltage reference buffer (VREF)                        */
/*                                                                            */
/******************************************************************************/
/****************** Bit definition for VREFBUF_CR register ********************/
#define VREFBUF_CR_VREFBUF_OUT_SEL_Pos            (0U)
#define VREFBUF_CR_VREFBUF_OUT_SEL_Msk            (0x3UL<<VREFBUF_CR_VREFBUF_OUT_SEL_Pos)           /*!< 0x00000003 */
#define VREFBUF_CR_VREFBUF_OUT_SEL                VREFBUF_CR_VREFBUF_OUT_SEL_Msk
#define VREFBUF_CR_VREFBUF_OUT_SEL_0              (0x1UL<<VREFBUF_CR_VREFBUF_OUT_SEL_Pos)           /*!< 0x00000001 */
#define VREFBUF_CR_VREFBUF_OUT_SEL_1              (0x2UL<<VREFBUF_CR_VREFBUF_OUT_SEL_Pos)           /*!< 0x00000002 */
#define VREFBUF_CR_VREFBUF_EN_Pos                 (3U)
#define VREFBUF_CR_VREFBUF_EN_Msk                 (0x1UL<<VREFBUF_CR_VREFBUF_EN_Pos)                /*!< 0x00000008 */
#define VREFBUF_CR_VREFBUF_EN                     VREFBUF_CR_VREFBUF_EN_Msk                         

/** @addtogroup Exported_macros
  * @{
  */

